"""
말투 (tone)
격식 있는: 공식적인 상황이나 문서에서 사용되는 예의 바르고 정중한 말투
친근한: 편안하고 따뜻한 느낌을 주는 부드러운 말투
딱딱한: 감정을 드러내지 않고 건조하게 사실만 전달하는 사무적인 말투
유머러스한: 우스갯소리나 농담을 섞어 즐거운 분위기를 만드는 말투
진지한: 무게감 있고 신중하게 자신의 의견을 전달하는 말투
긍정적인: 낙관적이고 희망적인 메시지를 전달하는 밝은 말투
부정적인: 비관적이고 불만스러운 감정을 드러내는 어두운 말투
설득적인: 상대방을 이해시키고 동의를 얻기 위해 논리적으로 말하는 말투
비판적인: 문제점을 지적하고 개선을 요구하는 날카로운 말투
중립적인: 어느 한쪽으로 치우치지 않고 객관적인 사실만 전달하는 말투
"""

"""
어조 (voice)
분석적인: 논리적이고 체계적으로 정보를 분석하고 해석하는 어조
설명적인: 복잡한 내용을 쉽고 명확하게 전달하는 어조
비판적인: 문제점을 지적하고 개선 방향을 제시하는 어조
주장하는: 자신의 의견을 강하게 피력하고 설득하는 어조
질문하는: 호기심을 가지고 질문을 통해 정보를 얻고 탐구하는 어조
사색적인: 깊이 생각하고 성찰하는 차분하고 조용한 어조
열정적인: 강한 의지와 흥분을 표현하는 활기찬 어조
객관적인: 개인적인 감정이나 편견 없이 사실을 전달하는 어조
감성적인: 감정과 느낌을 풍부하게 표현하는 섬세한 어조
창의적인: 독창적인 아이디어를 제시하고 새로운 관점을 제시하는 어조
"""

PERSONA_LIST = [
    {"name": "나준채",
     "gender" : "male",
    "birth_date": "1980-01-29",
    "tone" : "격식 있는",
    "voice" : "분석적인"
    },
    {"name": "양성일",
     "gender" : "male",
    "birth_date": "1990-01-01",
    "tone" : "진지한",
    "voice" : "설명적인"
    },
    {"name": "유영진",
     "gender" : "female",
    "birth_date": "1992-02-15",
    "tone" : "긍정적인",
    "voice" : "사색적인"
    },
    {"name": "이주혜",
     "gender" : "female",
    "birth_date": "1993-05-30",
    "tone" : "친근한",
    "voice" : "설명적인"
    },
    {"name": "한승준",
     "gender" : "male",
    "birth_date": "1997-04-15",
    "tone" : "설득적인",
    "voice" : "분석적인"
    },
    {"name": "정찬",
     "gender" : "male",
    "birth_date": "1995-05-03",
    "tone" : "딱딱한",
    "voice" : "분석적인"
    },
    {"name": "조용은",
     "gender" : "male",
    "birth_date": "1991-10-12",
    "tone" : "격식 있는",
    "voice" : "설명적인"
    },
    {"name": "이민희",
     "gender" : "female",
    "birth_date": "1997-02-28",
    "tone" : "긍정적인",
    "voice" : "질문하는"
    },
]